Autodesk.Revit.DB.LabelUtils.GetFailureSeverityName(Autodesk.Revit.DB.FailureSeverity)
Gets the user-visible name for the Severity of a Warning
Remarks:
The name is obtained in the current Revit language.
failureSeverity:
The Severity enum value
Returns:
Returns the user-visible name for the Severity of a Warning.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.LabelUtils.GetStructuralSectionShapeName(Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape)
Gets the user-visible name for a StructuralSectionShape.
Remarks:
The name is obtained in the current Revit language.
shape:
The StructuralSectionShape to get the user-visible name.
Returns:
Returns the user-visible name for the StructuralSectionShape.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.Analysis.gbXMLBuildingType,Autodesk.Revit.DB.Document)
Gets the user-visible name for a gbXMLBuildingType.
Remarks:
The name is obtained in the current Revit language.
buildingType:
The gbXMLBuildingType to get the user-visible name.
document:
The document from which to get the gbXMLBuildingType.
Returns:
Returns the user-visible name for a buildingType in gbXML.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input gXMLBuildingType is not available in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelForDiscipline(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a discipline.
Remarks:
The name is obtained in the current Revit language.
disciplineTypeId:
Identifier of the discipline.
Returns:
Returns the user-visible name for a discipline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Discipline must have a definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.LabelUtils.GetLabelForSymbol(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a symbol.
Remarks:
The name is obtained in the current Revit language.
symbolTypeId:
Identifier of the symbol to get the user-visible name.
Returns:
Returns the user-visible name for a symbol.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Symbol must have a definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.LabelUtils.GetLabelForSpec(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a spec.
Remarks:
The name is obtained in the current Revit language.
If the given identifier is a category, this method returns the name
of the Family Type spec with that category, e.g. "Family Type: Walls".
specTypeId:
Identifier of the spec to get the user-visible name.
Returns:
Returns the user-visible name for a spec.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given identifier is neither a spec nor a category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelForUnit(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a unit.
Remarks:
The name is obtained in the current Revit language.
unitTypeId:
Identifier of the unit to get the user-visible name.
Returns:
Returns the user-visible name for a unit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot find DisplayUnitTypeInfo for the given unit identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011